---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.RiserIntWithBoundaryMoreThanOnceFailure
source: html/3d0d6481-e2b2-c2d3-f6f5-5dedb761c241.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.RiserIntWithBoundaryMoreThanOnceFailure Property

Riser intersects with boundary more than once.

## Syntax (C#)
```csharp
public static FailureDefinitionId RiserIntWithBoundaryMoreThanOnceFailure { get; }
```